vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN247_DFP.pdsc
    <condition id="allOf.device=MCXN247.internal_condition">
      <require condition="device.MCXN247.internal_condition"/>
    </condition>
    <condition id="component.ak4497_adapter.condition_id">
      <require condition="allOf.device=MCXN247.internal_condition"/>
    </condition>
    <condition id="component.at_least_one_i2c_mux_device_enabled.condition_id">
      <require condition="allOf.component.i2c_mux_pca954x, device=MCXN247.internal_condition"/>
    </condition>
    <condition id="allOf.component.i2c_mux_pca954x, device=MCXN247.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_mux_pca954x"/>
      <require condition="device.MCXN247.internal_condition"/>
    </condition>
    <condition id="component.button.condition_id">
      <require condition="allOf.anyOf=allOf=component.gpio_adapter, driver.gpio, component.timer_manager, device=MCXN247.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.gpio_adapter, driver.gpio, component.timer_manager, device=MCXN247.internal_condition">
      <require condition="anyOf.allOf=component.gpio_adapter, driver.gpio.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="timer_manager"/>
      <require condition="device.MCXN247.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.gpio_adapter, driver.gpio.internal_condition">
      <accept condition="allOf.component.gpio_adapter, driver.gpio.internal_condition"/>
    </condition>
    <condition id="allOf.component.gpio_adapter, driver.gpio.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
    </condition>
    <condition id="component.cmsis_drivers.condition_id">
      <require condition="allOf.device=MCXN247.internal_condition"/>
    </condition>
    <condition id="component.codec_adapters.condition_id">
      <require condition="allOf.device=MCXN247.internal_condition"/>
    </condition>
    <condition id="component.codec_i2c.condition_id">
      <require condition="allOf.component.i2c_adapter_interface, device=MCXN247.internal_condition"/>
    </condition>
    <condition id="allOf.component.i2c_adapter_interface, device=MCXN247.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_adapter_interface"/>
      <require condition="device.MCXN247.internal_condition"/>
    </condition>
    <condition id="component.crc_adapter.condition_id">
      <require condition="allOf.driver.crc, device=MCXN247.internal_condition"/>
    </condition>
    <condition id="allOf.driver.crc, device=MCXN247.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="crc"/>
      <require condition="device.MCXN247.internal_condition"/>
    </condition>
    <condition id="component.cs42448_adapter.condition_id">
      <require condition="allOf.device=MCXN247.internal_condition"/>
    </condition>
    <condition id="component.cs42888_adapter.condition_id">
      <require condition="allOf.device=MCXN247.internal_condition"/>
    </condition>
    <condition id="component.ctimer_adapter.condition_id">
      <require condition="allOf.driver.ctimer, device=MCXN247.internal_condition"/>
    </condition>
    <condition id="allOf.driver.ctimer, device=MCXN247.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ctimer"/>
      <require condition="device.MCXN247.internal_condition"/>
    </condition>
    <condition id="component.da7212_adapter.condition_id">
      <require condition="allOf.device=MCXN247.internal_condition"/>
    </condition>
    <condition id="component.eeprom_AT25Fxxxx.condition_id">
      <require condition="allOf.device=MCXN247.internal_condition"/>
    </condition>
    <condition id="component.eeprom_AT45DBxxxx.condition_id">
      <require condition="allOf.device=MCXN247.internal_condition"/>
    </condition>
    <condition id="component.eeprom_InternalFlash.condition_id">
      <require condition="allOf.device=MCXN247.internal_condition"/>
    </condition>
    <condition id="device_id.MCXN247.internal_condition">
      <accept Dname="MCXN247VAB" Dvendor="NXP:11"/>
      <accept Dname="MCXN247VDF" Dvendor="NXP:11"/>
      <accept Dname="MCXN247VKL" Dvendor="NXP:11"/>
      <accept Dname="MCXN247VPB" Dvendor="NXP:11"/>
    </condition>
    <condition id="component.els_pkc.condition_id">
      <require condition="allOf.anyOf=allOf=anyOf=device_id=MCXN247, component.els_pkc.doc.mcxn, component.els_pkc.platform.mcxn, component.els_pkc.static_lib.mcxn, component.els_pkc.els, component.els_pkc.pkc, component.els_pkc.trng.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=anyOf=device_id=MCXN247, component.els_pkc.doc.mcxn, component.els_pkc.platform.mcxn, component.els_pkc.static_lib.mcxn, component.els_pkc.els, component.els_pkc.pkc, component.els_pkc.trng.internal_condition">
      <require condition="anyOf.allOf=anyOf=device_id=MCXN247, component.els_pkc.doc.mcxn, component.els_pkc.platform.mcxn, component.els_pkc.static_lib.mcxn.internal_condition"/>
      <require Cclass="MCXN247 els_pkc" Cgroup="els_pkc_els"/>
      <require Cclass="MCXN247 els_pkc" Cgroup="els_pkc_pkc"/>
      <require Cclass="MCXN247 els_pkc" Cgroup="els_pkc_trng"/>
    </condition>
    <condition id="anyOf.allOf=anyOf=device_id=MCXN247, component.els_pkc.doc.mcxn, component.els_pkc.platform.mcxn, component.els_pkc.static_lib.mcxn.internal_condition">
      <accept condition="allOf.anyOf=device_id=MCXN247, component.els_pkc.doc.mcxn, component.els_pkc.platform.mcxn, component.els_pkc.static_lib.mcxn.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=device_id=MCXN247, component.els_pkc.doc.mcxn, component.els_pkc.platform.mcxn, component.els_pkc.static_lib.mcxn.internal_condition">
      <require condition="anyOf.device_id=MCXN247.internal_condition"/>
      <require Cclass="MCXN247 els_pkc" Cgroup="doc" Csub="doc_mcxn"/>
      <require Cclass="MCXN247 els_pkc" Cgroup="els_pkc_platform"/>
      <require Cclass="MCXN247 els_pkc" Cgroup="static_lib_mcxn" Csub="mcxn"/>
    </condition>
    <condition id="anyOf.device_id=MCXN247.internal_condition">
      <accept condition="device_id.MCXN247.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.aead.condition_id">
      <require condition="allOf.component.els_pkc.aes, component.els_pkc.buffer, device=MCXN247.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.aes, component.els_pkc.buffer, device=MCXN247.internal_condition">
      <require Cclass="MCXN247 els_pkc" Cgroup="els_pkc_aes"/>
      <require Cclass="MCXN247 els_pkc" Cgroup="els_pkc_buffer"/>
      <require condition="device.MCXN247.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.aead_modes.condition_id">
      <require condition="allOf.component.els_pkc.aead, device=MCXN247.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.aead, device=MCXN247.internal_condition">
      <require Cclass="MCXN247 els_pkc" Cgroup="els_pkc_aead"/>
      <require condition="device.MCXN247.internal_condition"/>
    </condition>
