vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN247_DFP.pdsc
    <condition id="component.serial_manager_virtual.condition_id">
      <require condition="allOf.device=MCXN247.internal_condition"/>
    </condition>
    <condition id="component.sgtl_adapter.condition_id">
      <require condition="allOf.device=MCXN247.internal_condition"/>
    </condition>
    <condition id="component.silicon_id.condition_id">
      <require condition="allOf.anyOf=allOf=anyOf=device_id=MCXN247, component.silicon_id_mcxn, driver.common.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=anyOf=device_id=MCXN247, component.silicon_id_mcxn, driver.common.internal_condition">
      <require condition="anyOf.allOf=anyOf=device_id=MCXN247, component.silicon_id_mcxn.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="anyOf.allOf=anyOf=device_id=MCXN247, component.silicon_id_mcxn.internal_condition">
      <accept condition="allOf.anyOf=device_id=MCXN247, component.silicon_id_mcxn.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=device_id=MCXN247, component.silicon_id_mcxn.internal_condition">
      <require condition="anyOf.device_id=MCXN247.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="silicon_id_mcxn"/>
    </condition>
    <condition id="component.silicon_id_imx8.condition_id">
      <require condition="allOf.device=MCXN247.internal_condition"/>
    </condition>
    <condition id="component.silicon_id_imx93.condition_id">
      <require condition="allOf.device=MCXN247.internal_condition"/>
    </condition>
    <condition id="component.silicon_id_imxrt10xx.condition_id">
      <require condition="allOf.device=MCXN247.internal_condition"/>
    </condition>
    <condition id="component.silicon_id_imxrt1170.condition_id">
      <require condition="allOf.device=MCXN247.internal_condition"/>
    </condition>
    <condition id="component.silicon_id_imxrt1180.condition_id">
      <require condition="allOf.device=MCXN247.internal_condition"/>
    </condition>
    <condition id="component.silicon_id_mcxe31x.condition_id">
      <require condition="allOf.device=MCXN247.internal_condition"/>
    </condition>
    <condition id="component.silicon_id_mcxn.condition_id">
      <require condition="allOf.device=MCXN247.internal_condition"/>
    </condition>
    <condition id="component.silicon_id_rw610.condition_id">
      <require condition="allOf.device=MCXN247.internal_condition"/>
    </condition>
    <condition id="component.silicon_id_scfw.condition_id">
      <require condition="allOf.device=MCXN247.internal_condition"/>
    </condition>
    <condition id="component.software_crc_adapter.condition_id">
      <require condition="allOf.device=MCXN247.internal_condition"/>
    </condition>
    <condition id="component.software_rng_adapter.condition_id">
      <require condition="allOf.component.rng_adapter_interface, device=MCXN247.internal_condition"/>
    </condition>
    <condition id="allOf.component.rng_adapter_interface, device=MCXN247.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="rng_adapter_interface"/>
      <require condition="device.MCXN247.internal_condition"/>
    </condition>
    <condition id="component.tfa9896_adapter.condition_id">
      <require condition="allOf.device=MCXN247.internal_condition"/>
    </condition>
    <condition id="component.tfa9xxx_adapter.condition_id">
      <require condition="allOf.device=MCXN247.internal_condition"/>
    </condition>
    <condition id="component.timer_manager.condition_id">
      <require condition="allOf.anyOf=allOf=component.ctimer_adapter, driver.ctimer, allOf=component.lptmr_adapter, driver.lptmr, allOf=component.mrt_adapter, driver.mrt, allOf=component.ostimer_adapter, driver.ostimer, component.lists, driver.common, device=MCXN247.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.ctimer_adapter, driver.ctimer, allOf=component.lptmr_adapter, driver.lptmr, allOf=component.mrt_adapter, driver.mrt, allOf=component.ostimer_adapter, driver.ostimer, component.lists, driver.common, device=MCXN247.internal_condition">
      <require condition="anyOf.allOf=component.ctimer_adapter, driver.ctimer, allOf=component.lptmr_adapter, driver.lptmr, allOf=component.mrt_adapter, driver.mrt, allOf=component.ostimer_adapter, driver.ostimer.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MCXN247.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.ctimer_adapter, driver.ctimer, allOf=component.lptmr_adapter, driver.lptmr, allOf=component.mrt_adapter, driver.mrt, allOf=component.ostimer_adapter, driver.ostimer.internal_condition">
      <accept condition="allOf.component.ctimer_adapter, driver.ctimer.internal_condition"/>
      <accept condition="allOf.component.lptmr_adapter, driver.lptmr.internal_condition"/>
      <accept condition="allOf.component.mrt_adapter, driver.mrt.internal_condition"/>
      <accept condition="allOf.component.ostimer_adapter, driver.ostimer.internal_condition"/>
    </condition>
    <condition id="allOf.component.ctimer_adapter, driver.ctimer.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ctimer_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ctimer"/>
    </condition>
    <condition id="allOf.component.lptmr_adapter, driver.lptmr.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lptmr_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lptmr"/>
    </condition>
    <condition id="allOf.component.mrt_adapter, driver.mrt.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mrt_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mrt"/>
    </condition>
    <condition id="allOf.component.ostimer_adapter, driver.ostimer.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ostimer_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ostimer"/>
    </condition>
    <condition id="component.wifi_bt_module.88W8987.condition_id">
      <require condition="allOf.anyOf=component.wifi_bt_module.board_aw_cm358_usd, component.wifi_bt_module.board_aw_cm358ma, component.wifi_bt_module.board_murata_1zm_m2, component.wifi_bt_module.board_murata_1zm_usd, component.wifi_bt_module.board_ubx_jody_w2_usd, component.wifi_bt_module.config, device=MCXN247.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=component.wifi_bt_module.board_aw_cm358_usd, component.wifi_bt_module.board_aw_cm358ma, component.wifi_bt_module.board_murata_1zm_m2, component.wifi_bt_module.board_murata_1zm_usd, component.wifi_bt_module.board_ubx_jody_w2_usd, component.wifi_bt_module.config, device=MCXN247.internal_condition">
      <require condition="anyOf.component.wifi_bt_module.board_aw_cm358_usd, component.wifi_bt_module.board_aw_cm358ma, component.wifi_bt_module.board_murata_1zm_m2, component.wifi_bt_module.board_murata_1zm_usd, component.wifi_bt_module.board_ubx_jody_w2_usd.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_config"/>
      <require condition="device.MCXN247.internal_condition"/>
    </condition>
    <condition id="anyOf.component.wifi_bt_module.board_aw_cm358_usd, component.wifi_bt_module.board_aw_cm358ma, component.wifi_bt_module.board_murata_1zm_m2, component.wifi_bt_module.board_murata_1zm_usd, component.wifi_bt_module.board_ubx_jody_w2_usd.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_aw_cm358_usd"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_aw_cm358ma"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_murata_1zm_m2"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_murata_1zm_usd"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_ubx_jody_w2_usd"/>
    </condition>
    <condition id="component.wifi_bt_module.IW416.condition_id">
      <require condition="allOf.anyOf=component.wifi_bt_module.board_aw_am457_usd, component.wifi_bt_module.board_aw_am457ma, component.wifi_bt_module.board_aw_am510_arduino, component.wifi_bt_module.board_aw_am510_usd, component.wifi_bt_module.board_aw_am510ma, component.wifi_bt_module.board_murata_1xk_m2, component.wifi_bt_module.board_murata_1xk_usd, component.wifi_bt_module.board_ubx_maya_w1_usd, component.wifi_bt_module.config, device=MCXN247.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=component.wifi_bt_module.board_aw_am457_usd, component.wifi_bt_module.board_aw_am457ma, component.wifi_bt_module.board_aw_am510_arduino, component.wifi_bt_module.board_aw_am510_usd, component.wifi_bt_module.board_aw_am510ma, component.wifi_bt_module.board_murata_1xk_m2, component.wifi_bt_module.board_murata_1xk_usd, component.wifi_bt_module.board_ubx_maya_w1_usd, component.wifi_bt_module.config, device=MCXN247.internal_condition">
      <require condition="anyOf.component.wifi_bt_module.board_aw_am457_usd, component.wifi_bt_module.board_aw_am457ma, component.wifi_bt_module.board_aw_am510_arduino, component.wifi_bt_module.board_aw_am510_usd, component.wifi_bt_module.board_aw_am510ma, component.wifi_bt_module.board_murata_1xk_m2, component.wifi_bt_module.board_murata_1xk_usd, component.wifi_bt_module.board_ubx_maya_w1_usd.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_config"/>
      <require condition="device.MCXN247.internal_condition"/>
    </condition>
