vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN247_DFP.pdsc
    <condition id="driver.lpflexcomm_lpi2c.condition_id">
      <require condition="allOf.driver.lpflexcomm, device_id=MCXN247.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpflexcomm, device_id=MCXN247.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpflexcomm"/>
      <require condition="device_id.MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.lpflexcomm_lpi2c_edma.condition_id">
      <require condition="allOf.driver.edma4, driver.lpflexcomm_lpi2c, device=MCXN247.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma4, driver.lpflexcomm_lpi2c, device=MCXN247.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpi2c"/>
      <require condition="device.MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.lpflexcomm_lpspi.condition_id">
      <require condition="allOf.driver.lpflexcomm, device_id=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.lpflexcomm_lpspi_edma.condition_id">
      <require condition="allOf.driver.edma4, driver.lpflexcomm_lpspi, device=MCXN247.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma4, driver.lpflexcomm_lpspi, device=MCXN247.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi"/>
      <require condition="device.MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.lpflexcomm_lpuart.condition_id">
      <require condition="allOf.driver.lpflexcomm, device_id=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.lpflexcomm_lpuart_edma.condition_id">
      <require condition="allOf.driver.edma4, driver.lpflexcomm_lpuart, device=MCXN247.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma4, driver.lpflexcomm_lpuart, device=MCXN247.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require condition="device.MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.lptmr.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.lsm6dso.condition_id">
      <require condition="allOf.anyOf=driver.lpflexcomm_lpi2c, driver.common, device=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.max30101.condition_id">
      <require condition="allOf.anyOf=driver.lpflexcomm_lpi2c, driver.common, device=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.mcx_cmc.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.mcx_enet.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.mcx_spc.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.mcx_vbat.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.mem_interface.condition_id">
      <require condition="allOf.driver.common, driver.romapi, driver.romapi_flashiap, driver.romapi_nboot, device=MCXN247.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.romapi, driver.romapi_flashiap, driver.romapi_nboot, device=MCXN247.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="romapi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="romapi_flashiap"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="romapi_nboot"/>
      <require condition="device.MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.mma8451q.condition_id">
      <require condition="allOf.anyOf=driver.lpflexcomm_lpi2c, driver.common, device=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.mma8652fc.condition_id">
      <require condition="allOf.anyOf=driver.lpflexcomm_lpi2c, driver.common, device=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.mrt.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.mx25r_flash.condition_id">
      <require condition="allOf.device=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.nmh1000.condition_id">
      <require condition="allOf.anyOf=driver.lpflexcomm_lpi2c, driver.common, device=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.npx.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.opamp.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.ostimer.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.otp.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.p3t1755.condition_id">
      <require condition="allOf.anyOf=driver.lpflexcomm_lpi2c, driver.common, device=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.pcm186x.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.pcm186x_adapter, driver.codec, device=MCXN247.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.pcm186x_adapter, driver.codec, device=MCXN247.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pcm186x_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.pcm512x.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.pcm512x_adapter, driver.codec, device=MCXN247.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.pcm512x_adapter, driver.codec, device=MCXN247.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pcm512x_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MCXN247.internal_condition"/>
    </condition>
