vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN247_DFP.pdsc
    <condition id="driver.pf1550.condition_id">
      <require condition="allOf.anyOf=driver.lpflexcomm_lpi2c, driver.common, device=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.pf3000.condition_id">
      <require condition="allOf.anyOf=driver.lpflexcomm_lpi2c, driver.common, device=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.pf5020.condition_id">
      <require condition="allOf.anyOf=driver.lpflexcomm_lpi2c, driver.common, device=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.pint.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.plu.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.port.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.psp27801.condition_id">
      <require condition="allOf.driver.common, device=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.puf_v3.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.pwm.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.qdc.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.reset.condition_id">
      <require condition="allOf.device=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.romapi.condition_id">
      <require condition="allOf.driver.common, driver.mem_interface, driver.romapi_flashiap, driver.romapi_nboot, driver.runbootloader, device=MCXN247.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.mem_interface, driver.romapi_flashiap, driver.romapi_nboot, driver.runbootloader, device=MCXN247.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mem_interface"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="romapi_flashiap"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="romapi_nboot"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="runbootloader"/>
      <require condition="device.MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.romapi_flashiap.condition_id">
      <require condition="allOf.driver.common, driver.romapi, device=MCXN247.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.romapi, device=MCXN247.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="romapi"/>
      <require condition="device.MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.romapi_nboot.condition_id">
      <require condition="allOf.driver.common, driver.romapi, device=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.rtt.condition_id">
      <require condition="allOf.driver.rtt.template, device=MCXN247.internal_condition"/>
    </condition>
    <condition id="allOf.driver.rtt.template, device=MCXN247.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="rtt template"/>
      <require condition="device.MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.rtt.template.condition_id">
      <require condition="allOf.device=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.runbootloader.condition_id">
      <require condition="allOf.driver.common, driver.romapi, device=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.sctimer.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.sgtl5000.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.sgtl_adapter, driver.codec, device=MCXN247.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.sgtl_adapter, driver.codec, device=MCXN247.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="sgtl_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.sinc.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.smartcard_emvsim.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.smartcard_phy_emvsim.condition_id">
      <require condition="allOf.driver.common, driver.smartcard_emvsim, device_id=MCXN247.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.smartcard_emvsim, device_id=MCXN247.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="smartcard_emvsim"/>
      <require condition="device_id.MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.smartcard_phy_gpio.condition_id">
      <require condition="allOf.driver.common, driver.smartcard_uart, device_id=MCXN247.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.smartcard_uart, device_id=MCXN247.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="smartcard_uart"/>
      <require condition="device_id.MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.smartcard_phy_tda8035.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN247.internal_condition"/>
    </condition>
