vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN247_DFP.pdsc
    <condition id="driver.smartcard_uart.condition_id">
      <require condition="allOf.driver.common, device=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.smartdma.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.smartdma_mcxn.condition_id">
      <require condition="allOf.anyOf=device_id=MCXN247, driver.smartdma.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=device_id=MCXN247, driver.smartdma.internal_condition">
      <require condition="anyOf.device_id=MCXN247.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="smartdma"/>
    </condition>
    <condition id="driver.ssd1963.condition_id">
      <require condition="allOf.driver.dbi, device=MCXN247.internal_condition"/>
    </condition>
    <condition id="allOf.driver.dbi, device=MCXN247.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dbi"/>
      <require condition="device.MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.st7796s.condition_id">
      <require condition="allOf.driver.dbi, device=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.syspm.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.tdet.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.tfa9896.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.tfa9896_adapter, driver.codec, device=MCXN247.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.tfa9896_adapter, driver.codec, device=MCXN247.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="tfa9896_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.tfa9xxx.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.tfa9xxx_adapter, driver.codec, device=MCXN247.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.tfa9xxx_adapter, driver.codec, device=MCXN247.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="tfa9xxx_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.tfa9xxx_hal.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, driver.codec, driver.tfa9xxx, device=MCXN247.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, driver.codec, driver.tfa9xxx, device=MCXN247.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="tfa9xxx"/>
      <require condition="device.MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.tma525b.condition_id">
      <require condition="allOf.device=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.trdc_1.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN247, driver.trdc_soc.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, device_id=MCXN247, driver.trdc_soc.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device_id.MCXN247.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="trdc_soc"/>
    </condition>
    <condition id="driver.trdc_soc.condition_id">
      <require condition="allOf.device=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.tsl2561.condition_id">
      <require condition="allOf.anyOf=driver.lpflexcomm_lpi2c, driver.common, device=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.utick.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.video-common.condition_id">
      <require condition="allOf.driver.common, device=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.vref_1.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.wm8524.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.wm8524_adapter, driver.codec, device=MCXN247.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.wm8524_adapter, driver.codec, device=MCXN247.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wm8524_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.wm8904.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.wm8904_adapter, driver.codec, device=MCXN247.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.wm8904_adapter, driver.codec, device=MCXN247.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wm8904_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MCXN247.internal_condition"/>
    </condition>
    <condition id="driver.wm8960.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.wm8960_adapter, driver.codec, device=MCXN247.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.wm8960_adapter, driver.codec, device=MCXN247.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wm8960_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MCXN247.internal_condition"/>
    </condition>
