vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN247_DFP.pdsc
  </conditions>
  <components>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="cmake_toolchain" Cversion="1.0.0" condition="cmake_toolchain.condition_id">
      <description>Cmake_toolchain</description>
      <files>
        <file category="other" name="tools/cmake_toolchain_files/armgcc.cmake" projectpath="cmake_toolchain_files"/>
        <file category="other" name="tools/cmake_toolchain_files/xcc.cmake" projectpath="cmake_toolchain_files"/>
        <file category="other" name="tools/cmake_toolchain_files/xclang.cmake" projectpath="cmake_toolchain_files"/>
        <file category="other" name="tools/cmake_toolchain_files/armgcc_force_cpp.cmake" projectpath="cmake_toolchain_files"/>
        <file category="other" name="tools/cmake_toolchain_files/mcux_config.cmake" projectpath="cmake_toolchain_files"/>
        <file category="other" name="tools/cmake_toolchain_files/riscvllvm.cmake" projectpath="cmake_toolchain_files"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ak4497_adapter" Cversion="2.2.0" condition="component.ak4497_adapter.condition_id">
      <description>Component ak4497 adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/ak4497/fsl_codec_ak4497_adapter.h" projectpath="codec/port/ak4497"/>
        <file category="sourceC" name="components/codec/port/ak4497/fsl_codec_ak4497_adapter.c" projectpath="codec/port/ak4497"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/ak4497/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="one_i2c_mux_device_enabled" Cversion="1.0.0" condition="component.at_least_one_i2c_mux_device_enabled.condition_id">
      <description>Component at_least_one_i2c_mux_device_enabled</description>
      <files>
        <file category="doc" name="components/i2c/muxes/component.at_least_one_i2c_mux_device_enabled_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="button" Cversion="1.0.0" condition="component.button.condition_id">
      <description>Component button</description>
      <files>
        <file category="header" name="components/button/fsl_component_button.h" projectpath="component/button"/>
        <file category="sourceC" name="components/button/fsl_component_button.c" projectpath="component/button"/>
        <file category="include" name="components/button/"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="cmsis_drivers" Cversion="2.0.0" condition="component.cmsis_drivers.condition_id">
      <description>CMSIS driver</description>
      <files>
        <file category="doc" name="components/cmsis_drivers/component.cmsis_drivers_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters" Cversion="2.2.0" condition="component.codec_adapters.condition_id">
      <description>Component codec adapters for multi codec</description>
      <RTE_Components_h>
#ifndef CODEC_MULTI_ADAPTERS
#define CODEC_MULTI_ADAPTERS 1
#endif
</RTE_Components_h>
      <files>
        <file category="sourceC" name="components/codec/port/fsl_codec_adapter.c" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c" Cversion="2.1.0" condition="component.codec_i2c.condition_id">
      <description>Component codec_i2c</description>
      <RTE_Components_h>
        #ifndef SDK_I2C_BASED_COMPONENT_USED
        #define SDK_I2C_BASED_COMPONENT_USED 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="header" name="components/codec/i2c/fsl_codec_i2c.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/i2c/fsl_codec_i2c.c" projectpath="codec"/>
        <file category="include" name="components/codec/i2c/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="crc_adapter" Cversion="1.0.0" condition="component.crc_adapter.condition_id">
      <description>Component crc_adapter</description>
      <files>
        <file category="header" name="components/crc/fsl_adapter_crc.h" projectpath="component/crc"/>
        <file category="sourceC" name="components/crc/fsl_adapter_crc.c" projectpath="component/crc"/>
        <file category="include" name="components/crc/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cs42448_adapter" Cversion="2.2.1" condition="component.cs42448_adapter.condition_id">
      <description>Component cs42448 adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/cs42448/fsl_codec_cs42448_adapter.h" projectpath="codec/port/cs42448"/>
        <file category="sourceC" name="components/codec/port/cs42448/fsl_codec_cs42448_adapter.c" projectpath="codec/port/cs42448"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/cs42448/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cs42888_adapter" Cversion="2.2.1" condition="component.cs42888_adapter.condition_id">
      <description>Component cs42888 adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/cs42888/fsl_codec_cs42888_adapter.h" projectpath="codec/port/cs42888"/>
        <file category="sourceC" name="components/codec/port/cs42888/fsl_codec_cs42888_adapter.c" projectpath="codec/port/cs42888"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/cs42888/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
