vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN247_DFP.pdsc
    <component Cclass="MCXN247 els_pkc" Cgroup="els_pkc_pre_processor" Cversion="1.9.0" condition="component.els_pkc.pre_processor.condition_id">
      <description>Component els_pkc.pre_processor</description>
      <files>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslCPreProcessor/inc/mcuxCsslAnalysis.h" projectpath="component/els_pkc/src/comps/mcuxCsslCPreProcessor/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslCPreProcessor/inc/mcuxCsslCPreProcessor.h" projectpath="component/els_pkc/src/comps/mcuxCsslCPreProcessor/inc"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxCsslCPreProcessor/inc/"/>
      </files>
    </component>
    <component Cclass="MCXN247 els_pkc" Cgroup="els_pkc_prng" Cversion="1.9.0" condition="component.els_pkc.prng.condition_id">
      <description>Component prng</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPrng/src/mcuxClPrng_ELS.c" projectpath="component/els_pkc/src/comps/mcuxClPrng/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPrng/inc/internal/mcuxClPrng_Internal.h" projectpath="component/els_pkc/src/comps/mcuxClPrng/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPrng/inc/internal/mcuxClPrng_Internal_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClPrng/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPrng/inc/internal/mcuxClPrng_Internal_ELS.h" projectpath="component/els_pkc/src/comps/mcuxClPrng/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPrng/inc/internal/mcuxClPrng_Internal_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClPrng/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPrng/inc/internal/mcuxClPrng_Internal_Types.h" projectpath="component/els_pkc/src/comps/mcuxClPrng/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClPrng/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClPrng/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MCXN247 els_pkc" Cgroup="els_pkc_psa_driver" Cversion="1.9.0" condition="component.els_pkc.psa_driver.condition_id">
      <description>Component els_pkc_psa_driver</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_Aead.c" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_Cipher.c" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_DER_functions.c" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_export_public_key.c" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_generate_ecp_key.c" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_Hash.c" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_Key.c" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_Mac.c" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_Rsa.c" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_Sign.c" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_UpdateKeyStatus.c" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_Verify.c" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPsaDriver/inc/mcuxClPsaDriver.h" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPsaDriver/inc/mcuxClPsaDriver_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPsaDriver/inc/mcuxClPsaDriver_MemoryConsumption.h" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPsaDriver/inc/mcuxClPsaDriver_Oracle.h" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPsaDriver/inc/els_pkc_crypto_primitives.h" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPsaDriver/inc/els_pkc_crypto_composites.h" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPsaDriver/inc/internal/mcuxClPsaDriver_ExternalMacroWrappers.h" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPsaDriver/inc/internal/mcuxClPsaDriver_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPsaDriver/inc/internal/mcuxClPsaDriver_Internal.h" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPsaDriver/inc/internal/mcuxClPsaDriver_Types.h" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClPsaDriver/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClPsaDriver/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MCXN247 els_pkc" Cgroup="els_pkc_random" Cversion="1.9.0" condition="component.els_pkc.random.condition_id">
      <description>Component els_pkc.random</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRandom/src/mcuxClRandom_DRBG.c" projectpath="component/els_pkc/src/comps/mcuxClRandom/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRandom/src/mcuxClRandom_PRNG.c" projectpath="component/els_pkc/src/comps/mcuxClRandom/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandom/inc/mcuxClRandom.h" projectpath="component/els_pkc/src/comps/mcuxClRandom/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandom/inc/mcuxClRandom_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClRandom/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandom/inc/mcuxClRandom_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClRandom/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandom/inc/mcuxClRandom_Types.h" projectpath="component/els_pkc/src/comps/mcuxClRandom/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandom/inc/internal/mcuxClRandom_Internal_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClRandom/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandom/inc/internal/mcuxClRandom_Internal_Memory.h" projectpath="component/els_pkc/src/comps/mcuxClRandom/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandom/inc/internal/mcuxClRandom_Internal_Types.h" projectpath="component/els_pkc/src/comps/mcuxClRandom/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClRandom/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClRandom/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MCXN247 els_pkc" Cgroup="els_pkc_random_modes" Cversion="1.9.0" condition="component.els_pkc.random_modes.condition_id">
      <description>Component els_pkc.random_modes</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRandomModes/src/mcuxClRandomModes_CtrDrbg_Els.c" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRandomModes/src/mcuxClRandomModes_ElsMode.c" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRandomModes/src/mcuxClRandomModes_PatchMode.c" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRandomModes/src/mcuxClRandomModes_TestMode.c" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/mcuxClRandomModes.h" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/mcuxClRandomModes_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/mcuxClRandomModes_Functions_PatchMode.h" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/mcuxClRandomModes_Functions_TestMode.h" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/mcuxClRandomModes_Internal_SizeDefinitions.h" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/mcuxClRandomModes_Private_CtrDrbg.h" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/mcuxClRandomModes_Private_CtrDrbg_BlockCipher.h" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/mcuxClRandomModes_Private_Drbg.h" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/mcuxClRandomModes_Private_NormalMode.h" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/mcuxClRandomModes_Private_PatchMode.h" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/mcuxClRandomModes_Private_PrDisabled.h" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/mcuxClRandomModes_Private_TestMode.h" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MCXN247 els_pkc" Cgroup="els_pkc_random_modes_ctr" Cversion="1.9.0" condition="component.els_pkc.random_modes_ctr.condition_id">
      <description>Component els_pkc.random_modes_ctr</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRandomModes/src/mcuxClRandomModes_CtrDrbg.c" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRandomModes/src/mcuxClRandomModes_CtrDrbg_PrDisabled.c" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRandomModes/src/mcuxClRandomModes_NormalMode.c" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRandomModes/src/mcuxClRandomModes_PrDisabled.c" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/src"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MCXN247 els_pkc" Cgroup="els_pkc_random_modes_hmacdrbg" Cversion="1.9.0" condition="component.els_pkc.random_modes_hmacdrbg.condition_id">
      <description>Component els_pkc.random_modes_hmacdrbg</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRandomModes/src/mcuxClRandomModes_HmacDrbg.c" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/mcuxClRandomModes_Internal_HmacDrbg_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/mcuxClRandomModes_Private_HmacDrbg.h" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/"/>
      </files>
    </component>
