vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN247_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_aw_am510_usd" Cversion="1.0.0" condition="component.wifi_bt_module.board_aw_am510_usd.condition_id">
      <description>IW416-AW-AM510-USD Wi-Fi board</description>
      <RTE_Components_h>
        #ifndef WIFI_IW416_BOARD_AW_AM510_USD
        #define WIFI_IW416_BOARD_AW_AM510_USD
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_aw_am510_usd_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_aw_am510ma" Cversion="1.0.0" condition="component.wifi_bt_module.board_aw_am510ma.condition_id">
      <description>IW416-AW-AM510-M2 Wi-Fi board</description>
      <RTE_Components_h>
        #ifndef WIFI_IW416_BOARD_AW_AM510MA
        #define WIFI_IW416_BOARD_AW_AM510MA
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_aw_am510ma_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_aw_cm358_usd" Cversion="1.0.0" condition="component.wifi_bt_module.board_aw_cm358_usd.condition_id">
      <description>AW-CM358-USD Wi-Fi board</description>
      <RTE_Components_h>
        #ifndef WIFI_88W8987_BOARD_AW_CM358_USD
        #define WIFI_88W8987_BOARD_AW_CM358_USD
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_aw_cm358_usd_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_aw_cm358ma" Cversion="1.0.0" condition="component.wifi_bt_module.board_aw_cm358ma.condition_id">
      <description>AW-CM358MA-M2 Wi-Fi board</description>
      <RTE_Components_h>
        #ifndef WIFI_88W8987_BOARD_AW_CM358MA
        #define WIFI_88W8987_BOARD_AW_CM358MA
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_aw_cm358ma_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_aw_nm191_usd" Cversion="1.0.0" condition="component.wifi_bt_module.board_aw_nm191_usd.condition_id">
      <description>AW-NM191-USD Wi-Fi board</description>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_aw_nm191_usd_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_aw_nm191ma" Cversion="1.0.0" condition="component.wifi_bt_module.board_aw_nm191ma.condition_id">
      <description>AW-NM191MA-M2 Wi-Fi board</description>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_aw_nm191ma_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_frdm_rw61x" Cversion="1.0.0" condition="component.wifi_bt_module.board_frdm_rw61x.condition_id">
      <description>FRDM-RW61X Wi-Fi board</description>
      <RTE_Components_h>
#ifndef WIFI_BOARD_FRDM_RW61X
#define WIFI_BOARD_FRDM_RW61X 
#endif
</RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_frdm_rw61x_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_k32w061_trnscver" Cversion="1.0.0" condition="component.wifi_bt_module.board_k32w061_transceiver.condition_id">
      <description>IK32W061-TRANSCEIVER Wi-Fi board</description>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_k32w061_transceiver_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_murata_1xk_m2" Cversion="1.0.0" condition="component.wifi_bt_module.board_murata_1xk_m2.condition_id">
      <description>IW416-MURATA-1XK-M2 Wi-Fi board</description>
      <RTE_Components_h>
        #ifndef WIFI_IW416_BOARD_MURATA_1XK_M2
        #define WIFI_IW416_BOARD_MURATA_1XK_M2
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_murata_1xk_m2_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_murata_1xk_usd" Cversion="1.0.0" condition="component.wifi_bt_module.board_murata_1xk_usd.condition_id">
      <description>IW416-MURATA-1XK-USD Wi-Fi board</description>
      <RTE_Components_h>
        #ifndef WIFI_IW416_BOARD_MURATA_1XK_USD
        #define WIFI_IW416_BOARD_MURATA_1XK_USD
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_murata_1xk_usd_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_murata_1zm_m2" Cversion="1.0.0" condition="component.wifi_bt_module.board_murata_1zm_m2.condition_id">
      <description>MURATA-1ZM-M2 Wi-Fi board</description>
      <RTE_Components_h>
        #ifndef WIFI_88W8987_BOARD_MURATA_1ZM_M2
        #define WIFI_88W8987_BOARD_MURATA_1ZM_M2
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_murata_1zm_m2_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_murata_1zm_usd" Cversion="1.0.0" condition="component.wifi_bt_module.board_murata_1zm_usd.condition_id">
      <description>MURATA-1ZM-USD Wi-Fi board</description>
      <RTE_Components_h>
        #ifndef WIFI_88W8987_BOARD_MURATA_1ZM_USD
        #define WIFI_88W8987_BOARD_MURATA_1ZM_USD
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_murata_1zm_usd_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_murata_2dl_m2" Cversion="1.0.0" condition="component.wifi_bt_module.board_murata_2dl_m2.condition_id">
      <description>IW611-MURATA-2DL-M2 Wi-Fi board</description>
      <RTE_Components_h>
        #ifndef WIFI_IW611_BOARD_MURATA_2DL_M2
        #define WIFI_IW611_BOARD_MURATA_2DL_M2
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_murata_2dl_m2_dummy.txt"/>
      </files>
    </component>
