vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN247_DFP.pdsc
    <component Cclass="Device" Cgroup="CMSIS" Csub="MCXN247_header" Cversion="1.0.0" condition="device.CMSIS.condition_id">
      <description>Device MCXN247_cmsis</description>
      <files>
        <file category="header" name="devices/MCXN247/fsl_device_registers.h" projectpath="device"/>
        <file condition="allOf.core_ids=cm33_core0.condition_id" category="header" name="devices/MCXN247/MCXN247.h" projectpath="device"/>
        <file condition="allOf.core_ids=cm33_core0.condition_id" category="header" name="devices/MCXN247/MCXN247_COMMON.h" projectpath="device"/>
        <file condition="allOf.core_ids=cm33_core0.condition_id" category="header" name="devices/MCXN247/MCXN247_features.h" projectpath="device"/>
        <file category="header" name="devices/MCXN247/periph/PERI_ADC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_AHBSC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_BSP32.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_CACHE64_CTRL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_CACHE64_POLSEL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_CAN.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_CDOG.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_CMC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_CRC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_CTIMER.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_DIGTMP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_DM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_DMA.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_EIM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_EMVSIM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_ENET.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_ERM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_EVTG.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_EWM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_FLEXIO.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_FLEXSPI.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_FMU.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_FMUTEST.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_FREQME.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_GDET.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_GPIO.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_HPDAC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_I2S.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_I3C.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_INPUTMUX.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_INTM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_ITRC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_LPCMP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_LPDAC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_LPI2C.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_LPSPI.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_LPTMR.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_LPUART.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_LP_FLEXCOMM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_MAILBOX.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_MRT.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_NPX.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_OPAMP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_OSTIMER.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_OTPC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_PDM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_PINT.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_PKC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_PLU.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_PORT.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_POWERQUAD.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_PUF.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_PWM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_QDC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_RTC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_S50.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_SCG.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_SCT.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_SEMA42.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_SINC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_SMARTDMA.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_SPC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_SYSCON.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_SYSPM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_TRDC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_TSI.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_USB.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_USBDCD.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_USBHS.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_USBHSDCD.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_USBNC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_USBPHY.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_USDHC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_UTICK.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_VBAT.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_VREF.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_WUU.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN247/periph/PERI_WWDT.h" projectpath="device/periph"/>
        <file category="include" name="devices/MCXN247/"/>
        <file category="include" name="devices/MCXN247/periph/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.RTE.condition_id">
      <description>Rte_device</description>
      <files>
        <file category="header" attr="config" name="devices/MCXN247/template/RTE_Device.h" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MCXN247/template/"/>
      </files>
    </component>
