vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN247_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ili9341" Cversion="1.0.2" condition="driver.ili9341.condition_id">
      <description>Driver ili9341</description>
      <files>
        <file category="header" name="components/display/ili9341/fsl_ili9341.h" projectpath="lcdc"/>
        <file category="sourceC" name="components/display/ili9341/fsl_ili9341.c" projectpath="lcdc"/>
        <file category="include" name="components/display/ili9341/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="inputmux" Cversion="2.0.9" condition="driver.inputmux.condition_id">
      <description>INPUTMUX Driver</description>
      <files>
        <file category="header" name="devices/MCXN247/drivers/fsl_inputmux.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXN247/drivers/fsl_inputmux.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXN247/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="inputmux_connections" Cversion="2.0.0" condition="driver.inputmux_connections.condition_id">
      <description>Inputmux_connections Driver</description>
      <files>
        <file category="header" name="devices/MCXN247/drivers/fsl_inputmux_connections.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXN247/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="intm" Cversion="2.1.0" condition="driver.intm.condition_id">
      <description>INTM Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXN247/drivers/fsl_intm.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXN247/drivers/fsl_intm.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXN247/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rtc" Cversion="2.3.3" condition="driver.irtc.condition_id">
      <description>IRTC Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXN247/drivers/fsl_irtc.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXN247/drivers/fsl_irtc.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXN247/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="itrc" Cversion="2.4.0" condition="driver.itrc.condition_id">
      <description>itrc Driver</description>
      <files>
        <file category="header" name="devices/MCXN247/drivers/fsl_itrc.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXN247/drivers/fsl_itrc.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXN247/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpadc" Cversion="2.9.3" condition="driver.lpadc.condition_id">
      <description>LPADC Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXN247/drivers/fsl_lpadc.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXN247/drivers/fsl_lpadc.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXN247/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpc_freqme" Cversion="2.1.2" condition="driver.lpc_freqme.condition_id">
      <description>lpc_freqme Driver</description>
      <files>
        <file category="header" name="devices/MCXN247/drivers/fsl_freqme.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXN247/drivers/fsl_freqme.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXN247/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpcmp" Cversion="2.3.2" condition="driver.lpcmp.condition_id">
      <description>LPCMP Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXN247/drivers/fsl_lpcmp.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXN247/drivers/fsl_lpcmp.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXN247/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpflexcomm" Cversion="2.2.1" condition="driver.lpflexcomm.condition_id">
      <description>LPFLEXCOMM Driver</description>
      <files>
        <file category="header" name="devices/MCXN247/drivers/fsl_lpflexcomm.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXN247/drivers/fsl_lpflexcomm.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXN247/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpi2c" Cversion="2.2.6" condition="driver.lpflexcomm_lpi2c.condition_id">
      <description>LPI2C Driver</description>
      <files>
        <file category="header" name="devices/MCXN247/drivers/fsl_lpi2c.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXN247/drivers/fsl_lpi2c.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXN247/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpi2c_edma" Cversion="2.0.1" condition="driver.lpflexcomm_lpi2c_edma.condition_id">
      <description>LPI2C EDMA Driver</description>
      <files>
        <file category="header" name="devices/MCXN247/drivers/fsl_lpi2c_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXN247/drivers/fsl_lpi2c_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXN247/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi" Cversion="2.2.9" condition="driver.lpflexcomm_lpspi.condition_id">
      <description>LPSPI Driver</description>
      <files>
        <file category="header" name="devices/MCXN247/drivers/fsl_lpspi.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXN247/drivers/fsl_lpspi.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXN247/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi_edma" Cversion="2.1.4" condition="driver.lpflexcomm_lpspi_edma.condition_id">
      <description>LPSPI EDMA Driver</description>
      <files>
        <file category="header" name="devices/MCXN247/drivers/fsl_lpspi_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXN247/drivers/fsl_lpspi_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXN247/drivers/"/>
      </files>
    </component>
