vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN247_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="psp27801" Cversion="1.0.0" condition="driver.psp27801.condition_id">
      <description>Driver psp27801</description>
      <files>
        <file category="header" name="components/display/psp27801/fsl_psp27801.h" projectpath="oled"/>
        <file category="sourceC" name="components/display/psp27801/fsl_psp27801.c" projectpath="oled"/>
        <file category="include" name="components/display/psp27801/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="PUFv3" Cversion="2.0.3" condition="driver.puf_v3.condition_id">
      <description>PUFv3 Driver</description>
      <files>
        <file category="header" name="devices/MCXN247/drivers/fsl_puf_v3.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXN247/drivers/fsl_puf_v3.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXN247/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pwm" Cversion="2.9.0" condition="driver.pwm.condition_id">
      <description>PWM Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXN247/drivers/fsl_pwm.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXN247/drivers/fsl_pwm.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXN247/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="qdc" Cversion="2.0.0" condition="driver.qdc.condition_id">
      <description>QDC Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXN247/drivers/fsl_qdc.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXN247/drivers/fsl_qdc.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXN247/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="reset" Cversion="2.4.0" condition="driver.reset.condition_id">
      <description>Reset Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXN247/drivers/fsl_reset.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXN247/drivers/fsl_reset.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXN247/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="romapi" Cversion="2.0.0" condition="driver.romapi.condition_id">
      <description>ROMAPI Driver</description>
      <files>
        <file category="header" name="devices/MCXN247/drivers/romapi/flash/fsl_flash.h" projectpath="drivers/flash"/>
        <file category="include" name="devices/MCXN247/drivers/romapi/flash/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="romapi_flashiap" Cversion="2.0.0" condition="driver.romapi_flashiap.condition_id">
      <description>ROMAPI FLASHIAP Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXN247/drivers/romapi/flash/src/fsl_flash.c" projectpath="drivers/flash/src"/>
        <file category="header" name="devices/MCXN247/drivers/romapi/flash/fsl_flash.h" projectpath="drivers/flash"/>
        <file category="header" name="devices/MCXN247/drivers/romapi/flash/fsl_efuse.h" projectpath="drivers/flash"/>
        <file category="header" name="devices/MCXN247/drivers/romapi/flash/fsl_flash_ffr.h" projectpath="drivers/flash"/>
        <file category="header" name="devices/MCXN247/drivers/romapi/flash/fsl_flexspi_nor_flash.h" projectpath="drivers/flash"/>
        <file category="include" name="devices/MCXN247/drivers/romapi/flash/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="romapi_nboot" Cversion="2.0.0" condition="driver.romapi_nboot.condition_id">
      <description>ROMAPI NBOOT Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXN247/drivers/romapi/nboot/src/fsl_nboot.c" projectpath="drivers/nboot/src"/>
        <file category="header" name="devices/MCXN247/drivers/romapi/nboot/fsl_nboot_hal.h" projectpath="drivers/nboot"/>
        <file category="header" name="devices/MCXN247/drivers/romapi/nboot/fsl_nboot.h" projectpath="drivers/nboot"/>
        <file category="include" name="devices/MCXN247/drivers/romapi/nboot/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rtt" Cversion="7.22.0" condition="driver.rtt.condition_id">
      <description>SEGGER Real Time Transfer(RTT)</description>
      <files>
        <file category="doc" name="components/rtt/License.txt" projectpath="rtt"/>
        <file category="doc" name="components/rtt/README.txt" projectpath="rtt"/>
        <file category="sourceC" name="components/rtt/RTT/SEGGER_RTT.c" projectpath="rtt/RTT"/>
        <file category="header" name="components/rtt/RTT/SEGGER_RTT.h" projectpath="rtt/RTT"/>
        <file category="sourceAsm" name="components/rtt/RTT/SEGGER_RTT_ASM_ARMv7M.S" projectpath="rtt/RTT"/>
        <file category="sourceC" name="components/rtt/RTT/SEGGER_RTT_printf.c" projectpath="rtt/RTT"/>
        <file category="sourceC" name="components/rtt/Syscalls/SEGGER_RTT_Syscalls_GCC.c" projectpath="rtt/Syscalls"/>
        <file category="sourceC" name="components/rtt/Syscalls/SEGGER_RTT_Syscalls_IAR.c" projectpath="rtt/Syscalls"/>
        <file category="sourceC" name="components/rtt/Syscalls/SEGGER_RTT_Syscalls_KEIL.c" projectpath="rtt/Syscalls"/>
        <file category="sourceC" name="components/rtt/Syscalls/SEGGER_RTT_Syscalls_SES.c" projectpath="rtt/Syscalls"/>
        <file category="doc" name="components/rtt/License.txt" projectpath="rtt"/>
        <file category="doc" name="components/rtt/README.txt" projectpath="rtt"/>
        <file category="include" name="components/rtt/RTT/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rtt template" Cversion="7.22.0" condition="driver.rtt.template.condition_id">
      <description>RTT template configuration</description>
      <files>
        <file category="header" attr="config" name="components/rtt/template/SEGGER_RTT_Conf.h" version="7.22.0" projectpath="rtt/template"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="runbootloader" Cversion="2.0.0" condition="driver.runbootloader.condition_id">
      <description>ROMAPI RUNBOOTLOADER Driver</description>
      <files>
        <file category="header" name="devices/MCXN247/drivers/romapi/runbootloader/fsl_runbootloader.h" projectpath="drivers/runbootloader"/>
        <file category="sourceC" name="devices/MCXN247/drivers/romapi/runbootloader/src/fsl_runbootloader.c" projectpath="drivers/runbootloader/src"/>
        <file category="include" name="devices/MCXN247/drivers/romapi/runbootloader/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sctimer" Cversion="2.5.1" condition="driver.sctimer.condition_id">
      <description>SCT Driver</description>
      <files>
        <file category="header" name="devices/MCXN247/drivers/fsl_sctimer.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXN247/drivers/fsl_sctimer.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXN247/drivers/"/>
      </files>
    </component>
